//侧边栏
const categories = [
    {
        name: ["家用电器"]
    },
    {
        name: ["手机", "运营商", "数码"]
    },
    {
        name: ["电脑", "办公", "文具用品"]
    },
    {
        name: ["家居", "家具", "家装", "厨具"]
    },
    {
        name: ["男装", "女装", "童装", "内衣"]
    },
    {
        name: ["美妆", "个护清洁", "宠物"],
    },
    {
        name: ["女鞋", "箱包", "珠宝"],
    },
    {
        name: ["男鞋", "运动 ", "运动", " 户外"],
    },
    {
        name: ["房产", "汽车 ", "汽车用品"],
    },
    {
        name: ["母婴", "玩具乐器"],
    },
    {
        name: ["食品", "酒类", "生鲜", "特产"],
    }
];
const Electrical = [
    {
        name: "电视",
        items: [
            "游戏电视",
            "艺术电视",
            "K歌电视",
            "会议电视",
            "电视音响套装",
            "75寸电视",
            "85寸电视",
            "98寸电视",
            "100寸电视",
            "电视挂架",
            "电视遥控器",
            "电视推车"
        ]
    },
    {
        name: "空调",
        items: [
            "新风空调",
            "以旧换新",
            "空调挂机",
            "空调柜机",
            "空调套装",
            "新一级能效",
            "挂机1.5匹",
            "柜机3匹",
            "变频空调",
            "中央空调",
            "移动空调"
        ]
    },
    {
        name: "洗衣机",
        items: [
            "滚筒洗衣机",
            "洗烘一体机",
            "波轮洗衣机",
            "洗烘套装",
            "迷你洗衣机",
            "洗衣机配件",
            "烘干机"
        ]
    },
    {
        name: "冰箱",
        items: [
            "多门",
            "对开门",
            "三门",
            "双门",
            "冰洗套装",
            "冷柜/冰吧",
            "酒柜",
            "冰箱配件"
        ]
    },
    {
        name: "厨卫大电",
        items: [
            "油烟机",
            "灶具",
            "烟灶套装",
            "集成灶",
            "集成水槽",
            "消毒柜",
            "洗碗机",
            "电热水器",
            "燃气热水器",
            "壁挂炉",
            "空气能热水器",
            "嵌入式厨电",
            "太阳能热水器",
            "烟机灶具配件",
            "电热水龙头"
        ]
    },
    {
        name: "环境电器",
        items: [
            "取暖器",
            "空气净化器",
            "加湿器",
            "净水器",
            "饮水机",
            "茶吧机",
            "除湿机",
            "电话机",
            "电风扇",
            "生活电器配件",
            "冷风扇"
        ]
    },
    {
        name: "清洁电器",
        items: [
            "吸尘器",
            "扫地机器人",
            "擦窗机器人",
            "蒸汽/电动拖把",
            "除螨仪",
            "洗地机"
        ]
    }
];
const Digital = [
    {
        name: "手机通讯",
        items: [
            "游戏手机",
            "拍照手机",
            "全面屏手机",
            "对讲机",
            "以旧换新",
            "手机维修",
            "AI手机",
            "卫星通话手机",
            "高端旗舰手机",
            "合约机",
            "二手手机",
            "性价比手机",
            "老人机",
            "小时达手机",
            "学生手机"
        ]
    },
    {
        name: "运营商",
        items: [
            "合约机",
            "手机卡",
            "宽带",
            "话费流量",
            "中国电信",
            "中国移动",
            "中国联通",
            "京东通信",
            "挑靓号"
        ]
    },
    {
        name: "手机配件",
        items: [
            "手机壳",
            "贴膜",
            "手机存储卡",
            "数据线",
            "充电器",
            "创意配件",
            "手机饰品",
            "手机电池",
            "苹果周边",
            "移动电源",
            "手机支架",
            "拍照配件",
            "手机散热器",
            "手机屏幕",
            "手机配件礼盒"
        ]
    },
    {
        name: "摄影摄像",
        items: [
            "数码相机",
            "微单相机",
            "单反相机",
            "拍立得",
            "运动相机",
            "摄像机",
            "镜头",
            "户外器材",
            "影棚器材",
            "冲印服务",
            "数码相框"
        ]
    },
    {
        name: "影音娱乐",
        items: [
            "蓝牙无线耳机",
            "音箱音响",
            "智能音箱",
            "收音机",
            "麦克风",
            "MP3/MP4",
            "专业音频",
            "音频线",
            "有线耳机",
            "直播设备",
            "乐器音箱",
            "拉杆K歌声箱",
            "舞台音箱",
            "黑胶唱片机"
        ]
    },
    {
        name: "电子教育",
        items: [
            "学习机",
            "点读笔",
            "早教益智",
            "录音笔",
            "电纸书",
            "电子词典",
            "复读机",
            "翻译机"
        ]
    },
];
const Electron = [
    {
        name: '电脑整机',
        items: ['笔记本', '游戏本', '平板电脑', '台式机', '一体机', '服务器', '工作站', '闺蜜机']
    },
    {
        name: '外设产品',
        items: ['鼠标', '键盘', '键鼠套装', '网络仪表仪器', 'U盘', '移动固态硬盘', '移动硬盘', '鼠标垫', '摄像头', '线缆', '手写板', '硬盘盒', '电脑工具', '电脑清洁', 'UPS电源', '插座', '平板电脑配件', '笔记本配件', '投屏器', '扩展坞', '键盘配件', '机柜', '电脑屏幕膜', '电脑支架', '笔记本散热器', '电脑电源电池']
    },
    {
        name: '游戏设备',
        items: ['游戏机', '游戏耳机', '手柄方向盘', '游戏软件', '游戏周边']
    },
    {
        name: '网络产品',
        items: ['路由器', '网络机顶盒', '交换机', '网络存储', '网卡', '5G4G上网', '网线', '网络配件', '数通网络设备']
    },
    {
        name: '办公设备',
        items: ['投影机', '投影配件', '打印机', '传真设备', '验钞点钞机', '扫描设备', '复合机', '碎纸机', '考勤门禁', '收银机', '会议音频视频', '保险柜', '装订封装机', '安防监控', '白板', '广告机', '办公大屏', '会议平板', '打码机']
    },
    {
        name: '耗材',
        items: ['硒鼓墨粉', '墨盒', '色带', '纸类', '刻录光盘']
    },
];
const Furniture = [
    {
        name: "厨具",
        items: [
            "水具酒具",
            "烹饪锅具",
            "炒锅",
            "碗碟套装",
            "厨房储物",
            "刀剪菜板",
            "锅具套装",
            "茶具",
            "咖啡具",
            "保温杯",
            "厨房置物架"
        ]
    },
    {
        name: "床上用品",
        items: [
            "床品四件套",
            "婚庆床品",
            "被子",
            "枕头",
            "毛毯",
            "电热毯",
            "水暖毯",
            "床单床笠",
            "宿舍床帘",
            "床垫床褥",
            "床旗",
            "凉席",
            "蚊帐"
        ]
    },
    {
        name: "居家布艺",
        items: [
            "一次性洗脸巾",
            "毛巾浴巾",
            "干发帽",
            "窗帘",
            "窗纱",
            "梦幻帘",
            "门帘",
            "桌布",
            "抱枕靠垫",
            "沙发垫",
            "飘窗垫",
            "地毯",
            "地垫",
            "蒲团"
        ]
    },
    {
        name: "生活日用",
        items: [
            "香薰熏香",
            "火机烟具",
            "衣架",
            "梳子",
            "指甲刀",
            "化妆镜",
            "洗漱杯",
            "日杂小件",
            "搓澡巾",
            "浴室置物架",
            "移动马桶",
            "马桶刷",
            "保暖防护",
            "净化除味",
            "雨伞雨具"
        ]
    }
];
const Cloth = [
    {
        name: "男装",
        items: [
            "新品推荐",
            "T恤",
            "牛仔裤",
            "休闲裤",
            "衬衫",
            "短裤",
            "POLO衫",
            "羽绒服",
            "设计师/潮牌",
            "唐装/中山装",
            "中老年男装",
            "加绒裤"
        ]
    },
    {
        name: "女装",
        items: [
            "当季热卖",
            "新品推荐",
            "商场同款",
            "时尚套装",
            "连衣裙",
            "半身裙",
            "T恤",
            "衬衫",
            "休闲裤",
            "牛仔裤",
            "短外套",
            "卫衣",
            "小西装",
            "风衣",
            "针织衫",
            "雪纺衫",
            "大码女装",
            "设计师/潮牌"
        ]
    },
    {
        name: "配饰",
        items: [
            "女士围巾/披肩",
            "光学眼镜/镜片",
            "毛线帽",
            "真手套",
            "毛线手套",
            "男士丝巾/围巾",
            "棒球帽",
            "太阳镜",
            "防辐射眼镜",
            "老花镜",
            "贝雷帽",
            "礼帽"]
    }
];

const Make = [
    {
        name: "面部护肤",
        items: ["礼盒", "美白", "防晒", "面膜", "洁面", "爽肤水", "精华", "眼霜", "乳液/面霜", "卸妆", "T区护理", "润唇膏"]
    },
    {
        name: "香水彩妆",
        items: ["隔离", "遮瑕", "气垫BB", "粉底", "腮红", "口红/唇膏", "唇釉/唇彩", "睫毛膏", "眼影", "眼线", "眉笔/眉粉", "散粉", "美甲", "女士香水"]
    },
    {
        name: "男士香水",
        items: ["男士香水", "彩妆工具", "男士彩妆", "彩妆套装"]
    },
    {
        name: "男士护肤",
        items: ["控油", "洁面", "乳液/面霜", "面膜", "爽肤水", "剃须", "精华", "防晒", "套装/礼盒"]
    },
    {
        name: "洗发护发",
        items: ["控油", "洁面", "乳液/面霜", "面膜", "爽肤水", "剃须", "精华", "防晒", "套装/礼盒"]
    },
    {
        name: "口腔护理",
        items: ["牙膏", "牙粉", "牙贴", "牙刷", "牙线", "漱口水", "口喷", "假牙清洁", "套装"]
    },
    {
        name: "身体护理",
        items: ["花露水", "沐浴露", "香皂", "洗手液", "护手霜", "浴盐", "润肤", "精油", "美颈", "美胸", "纤体塑形", "手膜/足膜", "男士洗液", "走珠/止汗露", "脱毛刀/膏", "套装"]
    }
];
const Ladies = [
    {
        name: "时尚女鞋",
        items: [
            "新品推荐",
            "女士休闲鞋",
            "女士凉鞋",
            "女士单鞋",
            "女士拖鞋",
            "高跟鞋",
            "妈妈鞋",
            "帆布鞋",
            "布鞋绣花鞋",
            "内增高",
            "雨鞋雨靴",
            "女靴",
            "雪山地靴",
            "鱼嘴鞋",
            "马丁靴",
            "踝靴",
            "松糕鞋",
            "坡跟鞋",
            "防水台",
            "鞋配件"
        ]
    },
    {
        name: "潮流女包",
        items: [
            "单肩包",
            "手提包",
            "斜挎包",
            "双肩包",
            "钱包",
            "手拿包",
            "卡包零钱包",
            "钥匙包"
        ]
    },
    {
        name: "精品男包",
        items: [
            "男士钱包",
            "双肩包",
            "单肩斜挎包",
            "商务公文包",
            "男士手包",
            "卡包名片夹",
            "钥匙包"
        ]
    },
    {
        name: "功能箱包",
        items: [
            "行李箱",
            "拉杆包",
            "旅行包",
            "电脑包",
            "休闲运动包",
            "书包",
            "登山包",
            "腰包胸包",
            "旅行配件"
        ]
    },
    {
        name: "奢侈品",
        items: [
            "箱包",
            "钱包",
            "服饰",
            "腰带",
            "鞋靴",
            "太阳镜眼镜框",
            "饰品",
            "配件"
        ]
    },
    {
        name: "精选大牌",
        items: [
            "GUCCI",
            "COACH",
            "雷朋",
            "施华洛世奇",
            "MK",
            "阿玛尼",
            "菲拉格慕",
            "普拉达",
            "巴宝莉",
            "万宝龙"
        ]
    },
    {
        name: "珠宝首饰",
        items: [
            "黄金",
            "时尚饰品",
            "银饰",
            "钻石",
            "翡翠",
            "和田玉",
            "K金",
            "水晶玛瑙",
            "彩宝",
            "铂金",
            "木串把件",
            "珍珠",
            "发饰"
        ]
    },
];
const Men = [
    {
        name: "流行男鞋",
        items: [
            "新品推荐",
            "男士休闲鞋",
            "男士凉鞋",
            "商务/正装皮鞋",
            "正装鞋",
            "帆布鞋",
            "男士拖鞋",
            "功能鞋",
            "传统鞋",
            "增高鞋",
            "男靴",
            "雨鞋",
            "工装鞋",
            "鞋配件"
        ]
    },
    {
        name: "运动鞋包",
        items: [
            "跑步鞋",
            "休闲鞋",
            "篮球鞋",
            "帆布鞋",
            "板鞋",
            "拖鞋",
            "运动包",
            "足球鞋",
            "专项运动鞋",
            "训练鞋"
        ]
    },
    {
        name: "运动服饰",
        items: [
            "T恤",
            "运动裤",
            "运动套装",
            "夹克/风衣",
            "运动配饰",
            "卫衣/套头衫",
            "运动背心",
            "健身服",
            "运动内衣",
            "羽绒服",
            "棉服"
        ]
    },
    {
        name: "健身训练",
        items: [
            "跑步机",
            "动感单车",
            "健身车",
            "椭圆机",
            "综合训练器",
            "划船机",
            "甩脂机",
            "倒立机",
            "踏步机",
            "哑铃",
            "仰卧板/收腹机",
            "瑜伽用品",
            "舞蹈用品",
            "运动护具",
            "健腹轮",
            "拉力器/臂力器",
            "跳绳",
            "引体向上器"
        ]
    },
    {
        name: "骑行运动",
        items: [
            "山地车",
            "公路车",
            "折叠车",
            "骑行服",
            "城市自行车",
            "穿戴装备",
            "自行车配件"
        ]
    }
];
const Property = [
    {
        name: "美容清洗",
        items: [
            "洗车机",
            "洗车枪",
            "玻璃水",
            "清洁剂",
            "镀晶镀膜",
            "车蜡",
            "汽车贴膜",
            "补漆笔",
            "毛巾掸子",
            "隐形车衣",
            "汽车改色膜"
        ]
    },
    {
        name: "安全自驾",
        items: [
            "胎压监测",
            "充气泵",
            "灭火器",
            "车载床",
            "应急救援",
            "防盗设备",
            "自驾野营",
            "保温箱",
            "储物箱",
            "GPS定位器"
        ]
    },
    {
        name: "汽车服务",
        items: [
            "保养维修",
            "洗车",
            "钣金喷漆",
            "清洗美容",
            "功能升级",
            "改装服务",
            "ETC驾驶培训",
            "油卡充值",
            "加油卡",
            "买车险"
        ]
    },
    {
        name: "电动车",
        items: [
            "电动自行车",
            "电动摩托车",
            "电动轻便摩托车",
            "平衡车",
            "电动滑板车",
            "电动三轮车",
            "电动车装备",
            "电动车零配件",
            "老年代步车"
        ]
    },
    {
        name: "摩托车",
        items: [
            "摩托车",
            "摩托车养护",
            "摩托手套",
            "摩托车护具",
            "摩托车骑行服",
            "摩托车蓝牙装备",
            "摩托车头盔",
            "其它摩托车装备",
            "摩托车骑行鞋",
            "骑士包",
            "摩托车雨衣",
            "摩托车风镜"
        ]
    },
    {
        name: "充电装备",
        items: [
            "便携充电枪",
            "交流充电桩",
            "直流充电桩",
            "充电保护箱",
            "放电枪",
            "充电桩配件"
        ]
    }
];
const Moth = [
    {
        name: "奶粉",
        items: [
            "1段",
            "2段",
            "3段",
            "4段",
            "孕妈奶粉",
            "特殊配方奶粉",
            "有机奶粉"
        ]
    },
    {
        name: "营养辅食",
        items: [
            "米粉/菜粉",
            "面条粥",
            "果泥果汁",
            "益生菌初乳",
            "DHA钙铁锌维生素",
            "清火开胃",
            "宝宝零食"
        ]
    },
    {
        name: "尿裤湿巾",
        items: [
            "拉拉裤",
            "成人尿裤",
            "婴儿湿巾"
        ]
    },
    {
        name: "喂养用品",
        items: [
            "奶瓶奶嘴",
            "吸奶器",
            "暖奶消毒",
            "辅食料理机",
            "牙胶安抚",
            "食物存储",
            "儿童餐具",
            "水壶/水杯",
            "围兜/防溅衣"
        ]
    },
    {
        name: "洗护用品",
        items: [
            "宝宝护肤",
            "日常护理",
            "洗发沐浴",
            "洗澡用具",
            "洗衣液/皂",
            "理发器",
            "婴儿口腔清洁",
            "座便器",
            "驱蚊防晒"
        ]
    }
];
const Foods = [
    {
        name: "新鲜水果",
        items: [
            "苹果",
            "橙子",
            "奇异果/猕猴桃",
            "火龙果",
            "榴莲",
            "芒果",
            "椰子",
            "车厘子",
            "百香果",
            "柚子",
            "国产水果",
            "进口水果"
        ]
    },
    {
        name: "蔬菜蛋品",
        items: [
            "蛋品",
            "叶菜类",
            "根茎类",
            "葱姜蒜椒",
            "鲜菌菇",
            "茄果瓜类",
            "半加工蔬菜",
            "半加工豆制品",
            "玉米",
            "山药",
            "地瓜/红薯"
        ]
    },
    {
        name: "精选肉类",
        items: [
            "猪肉",
            "牛肉",
            "羊肉",
            "鸡肉",
            "鸭肉",
            "冷鲜肉",
            "特色肉类",
            "内脏类",
            "冷藏熟食",
            "牛排",
            "牛腩",
            "鸡翅"
        ]
    },
    {
        name: "海鲜水产",
        items: [
            "鱼类",
            "虾类",
            "蟹类",
            "贝类",
            "海参",
            "鱿鱼/章鱼",
            "活鲜",
            "三文鱼",
            "大闸蟹",
            "小龙虾",
            "海鲜加工品",
            "海产干货"
        ]
    },
    {
        name: "冷饮冻食",
        items: [
            "水饺/馄饨",
            "汤圆/元宵",
            "面点",
            "奶酪/黄油",
            "方便速食",
            "火锅丸串",
            "冰淇淋",
            "冷藏饮料",
            "低温奶",
            "生日蛋糕"
        ]
    },
    {
        name: "中外名酒",
        items: [
            "白酒",
            "葡萄酒",
            "洋酒",
            "啤酒",
            "黄酒/养生酒",
            "收藏酒/陈年老酒",
            "配制酒",
            "果酒"
        ]
    },
    {
        name: "进口食品",
        items: [
            "牛奶",
            "饼干蛋糕",
            "糖/巧克力",
            "零食",
            "水",
            "饮料",
            "咖啡粉",
            "冲调品",
            "油",
            "方便食品",
            "米面调味"
        ]
    },
];
// 一个数组中直接定义了多个变量赋值，这在 JavaScript 中是不合法的
// const sum = [categories, Electrical, Digital, Electron, Furniture, Cloth, Make, Ladies, Men, Property, Mother, Foods];

export default{ categories, Electrical, Digital, Electron, Furniture, Cloth, Make, Ladies, Men, Property, Moth, Foods };
